import {ITasksItem} from './tabs-tasks.page';

export const TASKS_IN_PROGRESS: ITasksItem[] = [];
//     {
//         num: '№113444',
//         manufacture: 'АТ-5',
//         tare: 8,
//         test: 5
//     },
//     {
//         num: '№113445',
//         manufacture: 'АТ-6',
//         tare: 1,
//         test: 1
//     }
// ];

export const NEW_TASKS: ITasksItem[] = [
    {
        num: '№115623',
        manufacture: 'КЦА',
        tare: 4,
        test: 1,
        startPoint: {x: 449 / 720 * 1000, y: 282 / 405 * 1000},
        routes: [
            {x: 449 / 720 * 1000, y: 275 / 405 * 1000},
            {x: 449 / 720 * 1000, y: 275 / 405 * 1000},
            {x: 371 / 720 * 1000, y: 275 / 405 * 1000},
            {x: 371 / 720 * 1000, y: 266 / 405 * 1000},
            {x: 371 / 720 * 1000, y: 266 / 405 * 1000},
            {x: 367 / 720 * 1000, y: 266 / 405 * 1000},
            {x: 367 / 720 * 1000, y: 266 / 405 * 1000},
        ],
        testList: [
            {
                name: 'ВСГ КЦА (конц. Н2=99,9%об.)',
                val: 4
            }
        ]
    },
    {
        num: '№115627',
        manufacture: 'АТ-9',
        tare: 10,
        test: 1,
        startPoint: {x: 367 / 720 * 1000, y: 266 / 405 * 1000},
        routes: [
            {x: 370 / 720 * 1000, y: 266 / 405 * 1000},
            {x: 370 / 720 * 1000, y: 167 / 405 * 1000},
            {x: 370 / 720 * 1000, y: 167 / 405 * 1000},
            {x: 313 / 720 * 1000, y: 167 / 405 * 1000},
            {x: 313 / 720 * 1000, y: 171 / 405 * 1000}
        ],
        testList: [
            {
                name: 'Фр. бензин.100-180оС (АТ-9)',
                val: 2
            }
        ]
    },
    {
        num: 'В ЕЛК',
        manufacture: 'В ЕЛК',
        tare: 3,
        test: 1,
        startPoint: {x: 313 / 720 * 1000, y: 171 / 405 * 1000},
        routes: [
            {x: 313 / 720 * 1000, y: 167 / 405 * 1000},
            {x: 454 / 720 * 1000, y: 167 / 405 * 1000},
            {x: 454 / 720 * 1000, y: 167 / 287 * 1000},
        ],
        specialProps: ['elk']
    },
];
